<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use App\Models\Province;
class ProvinceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        
        $provincess = [
            'น่าน', 'พะเยา', 'ลำปาง', 'ลำพูน','อุตรดิตถ์', 'เชียงราย', 'เชียงใหม่', 'แพร่', 'แม่ฮ่องสอน', 'กรุงเทพมหานคร', 'กำแพงเพชร', 'ชัยนาท', 'นครนายก', 'นครปฐม', 
            'นครสวรรค์', 'นนทบุรี', 'ปทุมธานี', 'พระนครศรีอยุธยา', 'พิจิตร', 'พิษณุโลก', 'ลพบุรี', 'สมุทรปราการ', 'สมุทรสงคราม', 'สมุทรสาคร', 'สระบุรี', 'สิงห์บุรี', 
            'สุพรรณบุรี', 'สุโขทัย', 'อุทัยธานี', 'อ่างทอง', 'เพชรบูรณ์', 'กาฬสินธุ์', 'ขอนแก่น', 'ชัยภูมิ', 'นครพนม', 'นครราชสีมา', 'บึงกาฬ', 'บุรีรัมย์', 'มหาสารคาม', 'มุกดาหาร', 'ยโสธร', 'ร้อยเอ็ด', 'ศรีสะเกษ', 'สกลนคร', 
            'สุรินทร์', 'หนองคาย','หนองบัวลำภู', 'อำนาจเจริญ', 'อุดรธานี', 'อุบลราชธานี', 'เลย', 'กระบี่', 'ชุมพร', 'ตรัง', 'นครศรีธรรมราช', 'นราธิวาส', 'ปัตตานี', 'พังงา', 'พัทลุง', 'ภูเก็ต', 'ยะลา', 'ระนอง',  
            'สงขลา', 'สตูล','สุราษฎร์ธานี', 'จันทบุรี','ฉะเชิงเทรา', 'ชลบุรี','ตราด', 'ปราจีนบุรี','ระยอง', 'สระแก้ว','กาญจนบุรี', 'ตาก','ประจวบคีรีขันธ์', 'ราชบุรี', 'เพชรบุรี'
        ];
        foreach ($provincess as $provinces) {
            Province::factory()->create([
                'province' => $provinces,
            ]);
        }
    }
}
